const common = require('../common');

const quoteList = [
    "Ви отримуєте від життя лише те, що наважуєтеся попросити. Не бійтеся підвищувати планку. – Опра Уїнфрі",
    "Будь собою, інші ролі зайняті. – Оскар Уайльд",
    "Якщо ви не здаєтеся, це має значення – Стівен Хокінг",
    "Чим менше думаєш, тим більше у тебе однодумців",
    "Легше обдурити людей, ніж переконати їх у тому, що їх обдурено. –  Марк Твен",
    "Добре довіряти іншим, але не довіряти — значно краще. – Беніто Муссоліні"
];

function quoteHandler() {
    let randomInt = common.getRandomInt(0, quoteList.length);
    return quoteList[randomInt];
}

module.exports = quoteHandler;